- 2. 데이터 입출력

In [5]:
import numpy as np
import pandas as pd

- %%writefile 매직 명령어

In [6]:
%%writefile data/sample1.csv
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample1.csv

- CSV 파일 읽기

In [7]:
df = pd.read_csv('data/sample1.csv')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [8]:
df.columns

Index(['c1', 'c2', 'c3'], dtype='object')

- header line이 생략된 경우

In [9]:
%%writefile data/sample2.csv
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample2.csv

In [10]:
df = pd.read_csv('data/sample2.csv')
df

   1  1.11    one
0  2  2.22    two
1  3  3.33  three

In [11]:
df = pd.read_csv('data/sample2.csv', names=['c1', 'c2', 'c3'])
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [12]:
# index column 지정
df = pd.read_csv('data/sample1.csv', index_col='c1')
df

      c2     c3
c1
1   1.11    one
2   2.22    two
3   3.33  three

In [13]:

%%writefile data/sample3.tsv
c1  c2  c3  c4
0.179181    -1.538472   1.347553    0.43381
1.024209    0.087307    -1.281997   0.49265
0.417899    -2.002308   0.255245    -1.10515

Overwriting data/sample3.tsv

In [14]:
df = pd.read_csv('data/sample3.tsv', sep='\s+')     # blank 여러개 또는 탭: \s+
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

- 여러줄의 header

In [15]:
%%writefile data/sample4.csv
파일 제목: sample4.txt
데이터 포맷의 설명:
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample4.csv

In [16]:
df = pd.read_csv('data/sample4.csv', skiprows=2)
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

- CSV 파일 출력

In [17]:
df.to_csv('data/sample6.csv')
df = pd.read_csv('data/sample6.csv')
df

   Unnamed: 0  c1    c2     c3
0           0   1  1.11    one
1           1   2  2.22    two
2           2   3  3.33  three

In [18]:
del df['Unnamed: 0']
df.to_csv('data/sample7.csv', index=False)
df = pd.read_csv('data/sample7.csv')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

- 인터넷 상의 파일

In [19]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
# Name, Ticket column 지우고, data/titanic.csv로 저장
del df['Name'], df['Ticket']
df.to_csv('data/titianic.csv', index=False)
titanic = pd.read_csv('data/titianic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S

In [22]:
# 여러 컬럼을 삭제할 경우에는 drop method를 사용하기도 한다.
df.drop(columns=['Name','Ticket'], inplace=True)
df.head()

KeyError: "['Name', 'Ticket'] not found in axis"